Re1.5e6_0aoa/0/h
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      h;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    airfoil_lam
    {
        type            zeroGradient;
    }
    airfoil
    {
        type            fixedValue;
        value           uniform 0.00018072;
    }
    
    periodic1
    {
        type            cyclicAMI;
    }
    periodic2
    {
        type            cyclicAMI;
    }
    
    farfield
    {
        type            zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    
    tr_suction
    {
        type            zeroGradient;
    }
    tr_blowing
    {
        type            zeroGradient;
    }
    
}










// ************************************************************************* //
