Re1.5e6_0aoa/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

p_out           uniform 0;

internalField   $p_out;

boundaryField
{
    airfoil_lam
    {
        type            zeroGradient;
    }
    airfoil
    {
        type            zeroGradient;
    }
    periodic1
    {
        type		    cyclicAMI;
    }
    periodic2
    {
        type            cyclicAMI;
    }

    farfield
    {
	type                zeroGradient;

    }

    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type		fixedValue;
	    value		$p_out;
    }

    tr_suction
    {
        type            zeroGradient;
    }

    tr_blowing
    {
        type            zeroGradient;
    }

}

// ************************************************************************* //
