Re1.5e6_0aoa/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward;
}

gradSchemes
{
    default         Gauss linear;
    //grad(U)         cellLimited Gauss linear 1;
}

divSchemes
{
    default         Gauss linear;
    div(phi,U)      Gauss LUST grad(U);
    //div(phi,U)      Gauss linear;
    
    
    //div(phi,k)      Gauss limitedLinear 0.1;
    //div(phi,B)      Gauss limitedLinear 0.1;
    //div(B)          Gauss linear;
    
    //div(phi,nuTilda) Gauss limitedLinear 0.1;
    //div(lambVector)  Gauss linear;
    //div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         uncorrected;
}

fluxRequired
{
    default         no;
}

wallDist
{
method meshWave;
}




// ************************************************************************* //
