Re1.5e6_0aoa/system/probes
#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

fields (p U);
probeLocations
(

(0.340033 0.007778 -0.003)
(0.340033 0.007778 -0.006)
(0.340033 0.007778 -0.009)
(0.340033 0.007778 -0.012)
(0.340033 0.007778 -0.015)
(0.340033 0.007778 -0.018)
(0.340033 0.007778 -0.021)
(0.340033 0.007778 -0.024)
(0.340033 0.007778 -0.027)

(0.36398 0.004834 -0.003)
(0.36398 0.004834 -0.006)
(0.36398 0.004834 -0.009)
(0.36398 0.004834 -0.012)
(0.36398 0.004834 -0.015)
(0.36398 0.004834 -0.018)
(0.36398 0.004834 -0.021)
(0.36398 0.004834 -0.024)
(0.36398 0.004834 -0.027)

(0.391905 0.001132 -0.003000)
(0.391905 0.001132 -0.006000)
(0.391905 0.001132 -0.009000)
(0.391905 0.001132 -0.012000)
(0.391905 0.001132 -0.015000)
(0.391905 0.001132 -0.018000)
(0.391905 0.001132 -0.021000)
(0.391905 0.001132 -0.024000)
(0.391905 0.001132 -0.027000)

(0.395319 0.000658 -0.003)
(0.395319 0.000658 -0.006)
(0.395319 0.000658 -0.009)
(0.395319 0.000658 -0.012)
(0.395319 0.000658 -0.015)
(0.395319 0.000658 -0.018)
(0.395319 0.000658 -0.021)
(0.395319 0.000658 -0.024)
(0.395319 0.000658 -0.027)

(0.151389 0.023313 0.000000)
(0.151389 0.023313 -0.001500)
(0.151389 0.023313 -0.003000)
(0.151389 0.023313 -0.004500)
(0.151389 0.023313 -0.006000)
(0.151389 0.023313 -0.007500)
(0.151389 0.023313 -0.009000)
(0.151389 0.023313 -0.010500)
(0.151389 0.023313 -0.012000)
(0.151389 0.023313 -0.013500)
(0.151389 0.023313 -0.015000)
(0.151389 0.023313 -0.016500)
(0.151389 0.023313 -0.018000)
(0.151389 0.023313 -0.019500)
(0.151389 0.023313 -0.021000)
(0.151389 0.023313 -0.022500)
(0.151389 0.023313 -0.024000)
(0.151389 0.023313 -0.025500)
(0.151389 0.023313 -0.027000)
(0.151389 0.023313 -0.028500)


(0.340033 0.007778 0.000000)
(0.340033 0.007778 -0.001500)
(0.340033 0.007778 -0.003000)
(0.340033 0.007778 -0.004500)
(0.340033 0.007778 -0.006000)
(0.340033 0.007778 -0.007500)
(0.340033 0.007778 -0.009000)
(0.340033 0.007778 -0.010500)
(0.340033 0.007778 -0.012000)
(0.340033 0.007778 -0.013500)
(0.340033 0.007778 -0.015000)
(0.340033 0.007778 -0.016500)
(0.340033 0.007778 -0.018000)
(0.340033 0.007778 -0.019500)
(0.340033 0.007778 -0.021000)
(0.340033 0.007778 -0.022500)
(0.340033 0.007778 -0.024000)
(0.340033 0.007778 -0.025500)
(0.340033 0.007778 -0.027000)
(0.340033 0.007778 -0.028500)


(0.391905 0.001132 0.000000)
(0.391905 0.001132 -0.001500)
(0.391905 0.001132 -0.003000)
(0.391905 0.001132 -0.004500)
(0.391905 0.001132 -0.006000)
(0.391905 0.001132 -0.007500)
(0.391905 0.001132 -0.009000)
(0.391905 0.001132 -0.010500)
(0.391905 0.001132 -0.012000)
(0.391905 0.001132 -0.013500)
(0.391905 0.001132 -0.015000)
(0.391905 0.001132 -0.016500)
(0.391905 0.001132 -0.018000)
(0.391905 0.001132 -0.019500)
(0.391905 0.001132 -0.021000)
(0.391905 0.001132 -0.022500)
(0.391905 0.001132 -0.024000)
(0.391905 0.001132 -0.025500)
(0.391905 0.001132 -0.027000)
(0.391905 0.001132 -0.028500)

(0.039312 0.018564 -0.015)
(0.043522 0.019245 -0.015)
(0.047511 0.019825 -0.015)


);

// ************************************************************************* //

