Re1.5e6_0aoa/system/surfAverage
    sphereAverage
    {
        type            surfaces;
//        libs ("libfieldFunctionObjects.so");

        enabled        true;
        writeControl   timeStep;
        writeInterval  1;

        // Output to log&file (true) or to file only
        log             true;

        // Output field values as well
        writeFields     false;

        // Type of region: patch/faceZone/sampledSurface
        regionType      patch;

        // if patch or faceZone: name of patch or faceZone
        name            airfoil;

        // Operation: areaAverage/sum/weightedAverage ...
        operation       areaAverage;

        fields
        (
            p
            U
        );
    }


// ************************************************************************* //
